app/models/concerns/stock.rb

  def self.buy(brand, sku, units, user, comments="")
    t = StockTransaction.new(
      brand: brand,
      style: sku.style,
      color: sku.color,
      size: sku.size,
      code: sku.code,
      box_id: sku.box_id,
      reference_id: sku.reference_id,
      size_order: size_order_for(sku.size),
      kind: KIND_IN,
      units: units.to_i.abs,
      reason: Reason::BUY,
      comments: comments)
---
SELECT "stock_transactions".* FROM "stock_transactions" WHERE "stock_transactions"."brand_id" = $1 AND "stock_transactions"."style" = $2 AND "stock_transactions"."color" = $3 AND "stock_transactions"."size" = $4  [["brand_id", 1], ["style", "SS200105S"], ["color", "MIDNIGHT"], ["size", "AU6 US2"]]

  def self.adjust(brand, sku, units, user, comments="", size_order: nil, reason: nil, pl: nil)
    t = StockTransaction.new \
      brand:           brand,
      style:           sku.style,
      color:           sku.color,
      size:            sku.size,
      code:            sku.code,
      box_id:          sku.box_id,
      reference_id:    sku.reference_id,
      packing_list_id: pl&.id,
      size_order:      size_order || size_order_for(sku.size),
      units:           units.to_i.abs,
      reason:          reason,
      comments:        comments
---
SELECT "stock_transactions".* FROM "stock_transactions" WHERE "stock_transactions"."brand_id" = $1  [["brand_id", 1]]