app/controllers/brands_controller.rb

INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test_brand"], ["created_at", "2020-03-10 00:30:02.337843"], ["updated_at", "2020-03-10 00:30:02.337843"]]
---
  def create
    render json: Brand.create!(name: params[:name], user_id: @user.id)