app/controllers/qr_controller.rb

SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."access_token" = $1 LIMIT $2  [["access_token", "e2aeb1977588a26b878a7b9d44b25caf"], ["LIMIT", 1]]
---
  def set_access_token
    token = request.headers["Access-Token"]
    @token = ApiKey.find_by_access_token(token)