app/controllers/session_controller.rb

SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."access_token" = ? LIMIT ?  [["access_token", "a6af5e96b59cf533a8de0774dbf67013"], ["LIMIT", 1]]
DELETE FROM "api_keys" WHERE "api_keys"."id" = ?  [["id", 1]]
---
  def destroy
    key = ApiKey.find_by_access_token(params[:token])
    if key && key.destroy

SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def find_access_token
    ApiKey.find_by_user_id(@user.id)&.access_token

INSERT INTO "api_keys" ("access_token", "user_id", "expires_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create_access_token
    apikey = ApiKey.create!(user_id: @user.id)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "john@example.com"], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by_email(params[:email]&.downcase)