app/controllers/stock_controller.rb

  def log
    # 3. Agregar paginador (este no es urgente, pero lo vamos a tener que hacer.)
    render :json => StockTransaction.all.
      order(created_at: :desc).
      take(LOG_SIZE)
---
SELECT "stock_transactions".* FROM "stock_transactions"

  def set_access_token
    token = request.headers["Access-Token"]
    @token = ApiKey.find_by_access_token(token)
---
SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."access_token" = $1 LIMIT $2  [["access_token", "e2aeb1977588a26b878a7b9d44b25caf"], ["LIMIT", 1]]

  def set_brand
    @brand = Brand.find(params[:brand_id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]