app/models/api_key.rb

  def user
    @user ||= User.find(self.user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def generate_access_token
    begin
      self.access_token = SecureRandom.hex
    end while self.class.exists?(access_token: access_token)
---
SELECT 1 AS one FROM "api_keys" WHERE "api_keys"."access_token" = $1 LIMIT $2  [["access_token", "e2aeb1977588a26b878a7b9d44b25caf"], ["LIMIT", 1]]